# Grouping and Aggregation

In [1]:
import pandas as pd

In [5]:
data = {
    'Product ID': [101, 102, 103, 104, 105, 106],
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture', 'Office Supplies', 'Office Supplies'],
    'Quantity Sold': [30, 45, 10, 5, 50, 60],
    'Revenue': [3000, 4500, 2000, 1000, 2500, 3000]
}

In [8]:
df = pd.DataFrame(data)
df

   Product ID         Category  Quantity Sold  Revenue
0         101      Electronics             30     3000
1         102      Electronics             45     4500
2         103        Furniture             10     2000
3         104        Furniture              5     1000
4         105  Office Supplies             50     2500
5         106  Office Supplies             60     3000

In [9]:
df.describe()

       Product ID  Quantity Sold      Revenue
count    6.000000       6.000000     6.000000
mean   103.500000      33.333333  2666.666667
std      1.870829      22.286020  1169.045194
min    101.000000       5.000000  1000.000000
25%    102.250000      15.000000  2125.000000
50%    103.500000      37.500000  2750.000000
75%    104.750000      48.750000  3000.000000
max    106.000000      60.000000  4500.000000

In [10]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Product ID,6.0,103.500000,1.870829,101.0,102.25,103.5,104.75,106.0
Quantity Sold,6.0,33.333333,22.286020,5.0,15.00,37.5,48.75,60.0
Revenue,6.0,2666.666667,1169.045194,1000.0,2125.00,2750.0,3000.00,4500.0

In [11]:
df['Quantity Sold'].mean()

np.float64(33.333333333333336)

In [12]:
df['Revenue'].median()

2750.0

In [13]:
df['Quantity Sold'].mode()

0     5
1    10
2    30
3    45
4    50
5    60
Name: Quantity Sold, dtype: int64

In [14]:
df['Revenue'].std()

1169.045194450012

In [15]:
df['Quantity Sold'].var()

496.6666666666667

In [16]:
df['Quantity Sold'].sum()

np.int64(200)

In [17]:
df['Quantity Sold'].prod()

np.int64(202500000)

## Group By single column

In [ ]:
df

   Product ID         Category  Quantity Sold  Revenue
0         101      Electronics             30     3000
1         102      Electronics             45     4500
2         103        Furniture             10     2000
3         104        Furniture              5     1000
4         105  Office Supplies             50     2500
5         106  Office Supplies             60     3000

In [19]:
groupd = df.groupby('Category')
groupd

In [20]:
groupd['Quantity Sold'].mean()

Category
Electronics        37.5
Furniture           7.5
Office Supplies    55.0
Name: Quantity Sold, dtype: float64

In [22]:
groupd['Revenue'].sum()

Category
Electronics        7500
Furniture          3000
Office Supplies    5500
Name: Revenue, dtype: int64

In [23]:
groupd['Quantity Sold'].agg(['min', 'max'])

                 min  max
Category
Electronics       30   45
Furniture          5   10
Office Supplies   50   60

In [24]:
groupd['Quantity Sold'].agg(['min', 'sum'])

                 min  sum
Category
Electronics       30   75
Furniture          5   15
Office Supplies   50  110

## Group By multiple columns

In [25]:
grouped_multi = df.groupby(['Category', 'Product ID'])

In [26]:
grouped_multi['Quantity Sold'].sum()

Category         Product ID
Electronics      101           30
                 102           45
Furniture        103           10
                 104            5
Office Supplies  105           50
                 106           60
Name: Quantity Sold, dtype: int64

In [27]:
groupd.agg({
    'Quantity Sold': ['min', 'max', 'mean'],
    'Revenue': ['sum', 'mean']
})

                Quantity Sold           Revenue
                          min max  mean     sum    mean
Category
Electronics                30  45  37.5    7500  3750.0
Furniture                   5  10   7.5    3000  1500.0
Office Supplies            50  60  55.0    5500  2750.0

In [29]:
# custom function and apply()
def data_range(x):
    return x.max() - x.min()

groupd['Quantity Sold'].apply(data_range)

Category
Electronics        15
Furniture           5
Office Supplies    10
Name: Quantity Sold, dtype: int64